app/views/team/ranking/index.html.erb

  <tr>
    <td><%= User.find(ranking.user_id).full_name %></rd>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]