app/controllers/admin/assistances_controller.rb

SELECT "assistances".* FROM "assistances" ORDER BY name DESC
SELECT "assistances".* FROM "assistances" WHERE "assistances"."group_id" = $1 ORDER BY name DESC  [["group_id", 3]]
---
    def index
        @assistances = Assistance.all
        group_id = params[:group_id]
        if params[:group_id]
            @assistances = Assistance.search(group_id).order("name DESC")

SELECT "assistances_users".* FROM "assistances_users" WHERE "assistances_users"."assistance_id" = $1  [["assistance_id", 4]]
SELECT  "assistances_users".* FROM "assistances_users" WHERE "assistances_users"."user_id" = $1 LIMIT $2  [["user_id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def info_student()
        id_assistance = params[:assistance]
        lista= AssistancesUser.where(assistance_id: id_assistance)
        @students = []
        lista.each do |fs|