app/controllers/admin/documents_controller.rb

SELECT "documents".* FROM "documents"
---
  def index
    @documents = Document.all

SELECT "groups".* FROM "groups"
---
  def new
    @groups = Group.all