app/controllers/admin/groups_controller.rb

  def edit
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO "groups" ("created_at", "updated_at", "name", "tip_group", "schedule") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2017-10-12 07:36:01.459358"], ["updated_at", "2017-10-12 07:36:01.459358"], ["name", "Grupo 3"], ["tip_group", "Regular"], ["schedule", "Viernes 17:00-18:50"]]

  def update
    @group = Group.find(params[:id])
    if @group.update(group_params)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "groups" SET "schedule" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["schedule", "L-V 13:00-16:00"], ["updated_at", "2017-10-12 07:37:27.373419"], ["id", 1]]