app/controllers/admin/posts_controller.rb

  def new
    @groups = Group.all
---
SELECT "groups"."id" FROM "groups"

  def create
    post_attributes = post_params
    users_send_email = User.get_users_by_groups(post_attributes[:group_id])
    @post = Post.new(post_params)
     if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "title", "text") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2017-10-12 08:25:37.475614"], ["updated_at", "2017-10-12 08:25:37.475614"], ["title", "Nueva Noticiapara G3"], ["text", "Este es el cuerpo de la noticia!"]]

  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "text" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["text", "No hay entrenmineto los dias martes y miercoles por favor dejen de llegar!"], ["updated_at", "2017-10-31 18:23:34.273473"], ["id", 9]]