app/controllers/admin/requests_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "users" SET "is_accepted" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_accepted", "t"], ["updated_at", "2017-11-14 02:31:35.896567"], ["id", 26]]
---
  def accept
  	@user = User.find(params[:id])
  	if @user.update(is_accepted: true)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 11]]
---
  def reject
  	@user = User.find(params[:id])
  	if @user.destroy