app/controllers/admin/routines_controller.rb

  def index
    @routines = Routine.all
---
SELECT "routines".* FROM "routines"

  def show
    @routine = Routine.find(params[:id])
---
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def edit
    @routine = Routine.find(params[:id])
---
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @routine = Routine.new(routine_params)

     if @routine.save
---
INSERT INTO "routines" ("distance", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["distance", "100m"], ["description", "Pecho"], ["created_at", "2017-10-12 06:41:10.231720"], ["updated_at", "2017-10-12 06:41:10.231720"]]

  def update
    @routine = Routine.find(params[:id])

    if @routine.update(routine_params)
---
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "routines" SET "distance" = $1, "description" = $2, "updated_at" = $3 WHERE "routines"."id" = $4  [["distance", "1000m"], ["description", "Libre / Calentamiento "], ["updated_at", "2017-10-12 07:47:12.682065"], ["id", 2]]

  def destroy
    @routine = Routine.find(params[:id])
    @routine.destroy
---
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "routines" WHERE "routines"."id" = $1  [["id", 1]]