app/controllers/admin/students_controller.rb

SELECT "users".* FROM "users" ORDER BY full_name DESC
---
  def index
    @students = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "initial_forms".* FROM "initial_forms" WHERE "initial_forms"."user_id" = $1 ORDER BY "initial_forms"."id" ASC LIMIT $2  [["user_id", 23], ["LIMIT", 1]]
SELECT  "team_forms".* FROM "team_forms" WHERE "team_forms"."user_id" = $1 ORDER BY "team_forms"."id" ASC LIMIT $2  [["user_id", 27], ["LIMIT", 1]]
---
  def view_student
  	@student  =  User.find(params[:student_id])
    @group_id = @student.group_id
  	@assistancesGroup = Assistance.byGroupId(@group_id.to_i)
  	@from_time = Time.now
  	@comments = Comment.thisUserGroup(@student)
  	@videos = Video.where(user_id: @student.id)
  	@form = InitialForm.where(user_id: @student.id).first