app/controllers/admin/videos_controller.rb

INSERT INTO "videos" ("user_id", "link", "comment", "created_at", "updated_at", "remote_path") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def upload
    begin
    	@video = Video.new
    	client = DropboxApi::Client.new("bulRELf_jgAAAAAAAAAACN0I0-tJgLdc8QsH5Let93vT5CCbi6jRPQFW5VEjSFc5")
    	file_content = params[:file].tempfile
    	client.upload "/"+params[:file].original_filename.to_s, file_content
    	link = client.create_shared_link_with_settings("/"+params[:file].original_filename.to_s, {})
    	@video.link =  link::url.to_s[0,link::url.to_s.size-1]+'1'
    	@video.user_id = params[:user_id].to_i
    	@video.comment = params[:comment]
      @video.remote_path  = "/"+params[:file].original_filename.to_s
    	if @video.save

SELECT "groups".* FROM "groups"
---
  def index
  	client = DropboxApi::Client.new("bulRELf_jgAAAAAAAAAACN0I0-tJgLdc8QsH5Let93vT5CCbi6jRPQFW5VEjSFc5")
  	space = client.get_space_usage
  	@remaining = 100 - (space::used.to_f / space::allocation::allocated.to_f * 100.0).round(2)
    @groups = Group.all

SELECT "users".* FROM "users" WHERE "users"."group_id" = $1  [["group_id", 3]]
---
  def selectStudent
  	client = DropboxApi::Client.new("bulRELf_jgAAAAAAAAAACN0I0-tJgLdc8QsH5Let93vT5CCbi6jRPQFW5VEjSFc5")
  	space = client.get_space_usage
  	@remaining = 100 - (space::used.to_f / space::allocation::allocated.to_f * 100.0).round(2)
    @students = User.where(:group_id => params[:id])

SELECT "videos".* FROM "videos" WHERE "videos"."user_id" = $1  [["user_id", 23]]
---
  def newVideo
  	client = DropboxApi::Client.new("bulRELf_jgAAAAAAAAAACN0I0-tJgLdc8QsH5Let93vT5CCbi6jRPQFW5VEjSFc5")
  	space = client.get_space_usage
  	@remaining = 100 - (space::used.to_f / space::allocation::allocated.to_f * 100.0).round(2)
    @videos = Video.where(user_id: params[:id])

SELECT "videos".* FROM "videos"
DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 6]]
---
  def clear
    if params[:original] == params[:user_input]
      client = DropboxApi::Client.new("bulRELf_jgAAAAAAAAAACN0I0-tJgLdc8QsH5Let93vT5CCbi6jRPQFW5VEjSFc5")
      videos = Video.all
      videos.each do |video|
        client.delete video.remote_path