app/views/admin/students/_assistances_partial.html.erb


		<% if AssistancesUser.where(assistance_id: assistance.id).first.nil? == false %>
---
SELECT  "assistances_users".* FROM "assistances_users" WHERE "assistances_users"."assistance_id" = $1 AND "assistances_users"."user_id" = $2 LIMIT $3  [["assistance_id", 1], ["user_id", 25], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]