app/views/admin/students/index.html.erb

    <th>Grupo</th>
    <%= select_tag :group_id, options_from_collection_for_select(Group.all, :id, :name, params[:group_id]), include_blank: true %>
---
SELECT "groups".* FROM "groups"

  <td><%= student.full_name %></td>
  <td><%= Group.find(student.group_id).name %></td>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]