app/views/admin/students/view_student.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
<tr> <th> Correo </th> <td> <%= @student.email %> </td></tr>
<tr> <th> Grupo </th> <td> <%= Group.find(@student.group_id).name %> </td></tr>