app/controllers/user/assistances_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
   @total_true = 0
    @user = User.find(session[:user_id])
    @group_id = @user.group_id