app/controllers/user/comments_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."group_id" = $1 ORDER BY "comments"."updated_at" DESC  [["group_id", 1]]
---
  def index
  	  	@from_time = Time.now
  		@comments = Comment.thisUserGroup(User.find(session[:user_id]))