app/controllers/user/posts_controller.rb

  def index
  		@from_time = Time.now
  		@posts = Post.thisUserGroup(User.find(session[:user_id]))
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = $1 ORDER BY "posts"."updated_at" DESC  [["group_id", 1]]