app/controllers/user/videos_controller.rb

  def index
  	@videos = Video.where(user_id: session[:user_id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."user_id" = $1  [["user_id", 23]]