app/views/access/signup.html.erb

SELECT "groups".* FROM "groups"
---
                <div class='select-style'>
                 <%=  f.collection_select :group_id, Group.all , :id, :name, include_blank: false  %>