app/views/admin/posts/_form.html.erb

SELECT "groups"."id" FROM "groups"
---
       <%= f.label :grupo %><br>
       <%=  f.collection_select :group_id, Group.all, :id, :name, include_blank: false  %>