app/views/admin/posts/index.html.erb

     <% if post.group_id != nil  %>
        <td><%= Group.find(post.group_id).name %></td>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]