app/controllers/team/form_controller.rb

  def index
  	@form = TeamForm.where(:user_id => session[:user_id].to_s).first
  	if @form.nil?
  		@form = TeamForm.new({:user_id => session[:user_id]})
      @form.save
---
SELECT  "team_forms".* FROM "team_forms" WHERE "team_forms"."user_id" = $1 ORDER BY "team_forms"."id" ASC LIMIT $2  [["user_id", 23], ["LIMIT", 1]]
INSERT INTO "team_forms" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 27], ["created_at", "2017-11-14 03:09:00.892485"], ["updated_at", "2017-11-14 03:09:00.892485"]]

  def register
  	@form = TeamForm.where(:user_id => session[:user_id].to_s).first
  	if @form.update(team_form_paramas)
---
SELECT  "team_forms".* FROM "team_forms" WHERE "team_forms"."user_id" = $1 ORDER BY "team_forms"."id" ASC LIMIT $2  [["user_id", 27], ["LIMIT", 1]]
UPDATE "team_forms" SET "gender" = $1, "local_id" = $2, "passport_id" = $3, "tec_id" = $4, "birth_date" = $5, "weight_kg" = $6, "height_cm" = $7, "age" = $8, "blood_type" = $9, "right_handed" = $10, "emergency_contact_name" = $11, "local_id_receiver" = $12, "relation_type" = $13, "last_edition_national_games" = $14, "last_edition_university_team" = $15, "las_edition_national_team" = $16, "city_of_origin" = $17, "residence_location" = $18, "updated_at" = $19 WHERE "team_forms"."id" = $20