app/controllers/team/ranking_controller.rb

  def index
    @rankings = RankingLine.all
---
SELECT "ranking_lines".* FROM "ranking_lines" ORDER BY time DESC