app/views/user/assistances/index.html.erb

SELECT  "assistances_users".* FROM "assistances_users" WHERE "assistances_users"."assistance_id" = $1 AND "assistances_users"."user_id" = $2 LIMIT $3  [["assistance_id", 4], ["user_id", 23], ["LIMIT", 1]]
---
	<tr> <td> <%= assistance.name %>  </td>
		<td> <%=  AssistancesUser.where(assistance_id: assistance.id, user_id: @user.id).first.updated_at.to_date %>  </td>