app/views/admin/documents/_form.html.erb

     <%= f.label :grupo %><br>
     <%=  f.collection_select :group_id, Group.all, :id, :name, include_blank: false  %>
---
SELECT "groups".* FROM "groups"