app/views/admin/rankings/index.html.erb

  <th>Estilo</th>
  <%= select_tag :style, options_from_collection_for_select(RankingLine.all, :style, :style, params[:style]), include_blank: true %>
---
SELECT "ranking_lines".* FROM "ranking_lines" ORDER BY time DESC

  <tr>
    <td><%= User.find(ranking.user_id).full_name %></rd>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]