app/controllers/access_controller.rb

  def signup
    check_session_state
    @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def new
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at", "group_id", "password_digest", "full_name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def attempt_login
    if session[:user_id] != nil
      puts "Removing existing session session found..."
      session[:user_id] = nil
      session[:email] = nil
    end
  	if params[:email].present? && params[:password].present?
      found_user = User.where(:email => params[:email]).first
      if found_user
        authorized_user = found_user.authenticate(params[:password])
      end
    end
    if authorized_user
      if authorized_user.is_accepted
        session[:user_id] = authorized_user.id
        session[:email] = authorized_user.email
        flash[:notice] = "Bienvenido!"
        if authorized_user.is_admin
          redirect_to admin_index_path
        elsif Group.find(authorized_user.group_id).tip_group == 'Regular'
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "prueba@gmail.com"], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def recover_account

    @user = User.where(email: params[:email]).first
    if @user.nil? == false
      @user.update_attributes(token5: SecureRandom.base58(5), token10: SecureRandom.base58(10))
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "alejaro34@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "token5" = $1, "token10" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["token5", "V8Mz3"], ["token10", "Na4vf8u2fW"], ["updated_at", "2017-11-14 21:28:39.365013"], ["id", 6]]

  def update_account
      user = User.where(token5: params[:token5], token10: params[:token10]).first
      if user.nil? == false
        if  params[:new_pass] == params[:verify_pass]
          user.update(password: params[:new_pass])
---
SELECT  "users".* FROM "users" WHERE "users"."token5" = $1 AND "users"."token10" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["token5", "a2F7f"], ["token10", "KHXGbXbSWP"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$VYc3K70FWEi68vbdYNc5x.aRIrWKLY5TzIqJlBYP09ZTIJWj6GGfy"], ["updated_at", "2017-11-14 22:00:06.563795"], ["id", 6]]