app/controllers/mobile_controller.rb

  def assistance
  	@groups = Group.all
---
SELECT "groups".* FROM "groups"

  def new_assistance
  	@assistance = Assistance.new(assistance_params)
    if @assistance.save
---
INSERT INTO "assistances" ("name", "group_id") VALUES ($1, $2) RETURNING "id"  [["name", "TEST"], ["group_id", 1]]

  def selectStudents
    @group  = Assistance.find(params[:id]).group_id
    @students = User.where(:group_id => @group)
---
SELECT  "assistances".* FROM "assistances" WHERE "assistances"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."group_id" = $1  [["group_id", 1]]

  def finishAssistance
    @group  = Assistance.find(params[:id]).group_id
    @students = User.where(:group_id => @group)
    @assistance_id = params[:id]
    @students.each do |student|
    @new_assistance_record = AssistancesUser.new(user_id: student.id, assistance_id: @assistance_id )
    if params.has_key?(student.id.to_s)
        @new_assistance_record.present = true
      else
        @new_assistance_record.present = false
      end
      @new_assistance_record.save
---
SELECT  "assistances".* FROM "assistances" WHERE "assistances"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."group_id" = $1  [["group_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "assistances_users" ("user_id", "assistance_id", "created_at", "updated_at", "present") VALUES ($1, $2, $3, $4, $5)  [["user_id", 6], ["assistance_id", 4], ["created_at", "2017-11-06 22:47:49.693780"], ["updated_at", "2017-11-06 22:47:49.693780"], ["present", "f"]]

  def ranking
    @team = Group.where(tip_group: "Equipo").first
    @students = User.where(group_id: @team.id)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."tip_group" = $1 ORDER BY "groups"."id" ASC LIMIT $2  [["tip_group", "Equipo"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."group_id" = $1  [["group_id", 1]]

  def comments
    @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def selectStudent
    @students = User.where(:group_id => params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."group_id" = $1  [["group_id", 1]]

  def newRanking
    @student =  User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def newComment
    @student =  User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]

  def addComment
    @comment  =  Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("user_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 23], ["description", "Muy Buena Nadada! Solo levanta mas el brazo Izqueirdo! "], ["created_at", "2017-11-07 00:11:02.836833"], ["updated_at", "2017-11-07 00:11:02.836833"]]