app/controllers/user_controller.rb

  def fillForm
  	@form = InitialForm.where(:user_id => session[:user_id].to_s).first
  	if @form.nil?
  		@form = InitialForm.new({:user_id => session[:user_id]})
      @form.save
---
SELECT  "initial_forms".* FROM "initial_forms" WHERE "initial_forms"."user_id" = $1 ORDER BY "initial_forms"."id" ASC LIMIT $2  [["user_id", 23], ["LIMIT", 1]]
INSERT INTO "initial_forms" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 23], ["created_at", "2017-11-07 03:16:28.948000"], ["updated_at", "2017-11-07 03:16:28.948000"]]

  def register
  	@form = InitialForm.where(:user_id => session[:user_id].to_s).first
  	if @form.update(form_params)
---
SELECT  "initial_forms".* FROM "initial_forms" WHERE "initial_forms"."user_id" = $1 ORDER BY "initial_forms"."id" ASC LIMIT $2  [["user_id", 23], ["LIMIT", 1]]
UPDATE "initial_forms" SET "legal_id" = $1, "tec_id" = $2, "name" = $3, "carreer" = $4, "gender" = $5, "workplace" = $6, "study_address" = $7, "father_name" = $8, "mother_name" = $9, "home_address" = $10, "accident_name" = $11, "accident_telephone" = $12, "accident_comment" = $13, "accident_address" = $14, "team_history" = $15, "team_accomplishments" = $16, "semester" = $17, "current_year" = $18, "doctor_name" = $19, "blood_type" = $20, "deasease" = $21, "hospitalized" = $22, "surgery" = $23, "meds" = $24, "vitamins" = $25, "allergies" = $26, "bruises" = $27, "faints" = $28, "dizziness" = $29, "chestpain" = $30, "headeache" = $31, "cholesterol" = $32, "heart_studies" = $33, "heartattack_related" = $34, "skin_problems" = $35, "concussion" = $36, "memory_loss" = $37, "convulsions" = $38, "tingles" = $39, "cough" = $40, "eye_problems" = $41, "sprains" = $42, "diabetes" = $43, "pregnant" = $44, "updated_at" = $45 WHERE "initial_forms"."id" = $46