app/views/admin/requests/index.html.erb

			<td><%= user.full_name %></td>
			<td><%= Group.find(user.group_id).name %></td>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]