app/views/admin/videos/newVideo.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT "videos".* FROM "videos" WHERE "videos"."user_id" = $1  [["user_id", 23]]
---
   <div class="field">
    <h3> <%= "Video-Comentario para "+User.find(params[:id]).full_name %></h3>