app/views/admin/assistances/index.html.erb

SELECT "groups".* FROM "groups"
---
    <th>Grupo</th>
    <%= select_tag :group_id, options_from_collection_for_select(Group.all, :id, :name, params[:group_id]), include_blank: true %>

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <td><%= assistance.name %></td>
  <td><%= Group.find(assistance.group_id).name %></td>