app/views/admin/assistances/info_student.html.erb

SELECT  "assistances_users".* FROM "assistances_users" WHERE "assistances_users"."user_id" = $1 LIMIT $2  [["user_id", 6], ["LIMIT", 1]]
---
  <td>
    <% if (AssistancesUser.where(user_id: student.id).first.present) == true %>