app/views/layouts/_user_profile_logout.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
	<% if session[:user_id] != nil %>
		<%= User.find(session[:user_id]).full_name %><%= link_to 'Cerrar Sesión' , access_logout_path , method: :post%>